import { Link } from "react-router-dom"

import NewsBlock from "../../components/home/NewsBlock"
import Footer from "../../components/layout/Footer"

function News() {
    document.title = "Unite Gaming Shop | Итоги премии Steam 2025"

    return (
        <div>
            <div className="px-4 max-lg:px-[64px] product">
                <div className="max-w-255 m-auto">
                    <div className="text-[15.67px] font-medium flex items-center gap-3.5">
                        <Link to="/" className="flex items-center gap-1 w-fit text-[#969FA8]">
                            <img src="/partner/grid.png" alt="grid" style={{ width: 24 }} />
                            <span>Главная</span>
                            <img src="partner/arrow.png" alt="arrow" style={{ width: 24 }} />
                        </Link>
                        <p className="text-white">Новости</p>
                    </div>

                    <div className="mt-[32px] mb-[40px]">
                        <p className="text-[#888BAA] text-[14px] font-medium">07.01.2026</p>
                        <p className="mt-[10px] flex text-white font-medium text-[32px] leading-9">Итоги премии Steam 2025</p>
                    </div>
                    <img src="home/news/1.png" alt="news" className="w-full rounded-3xl" />

                    <div className="mt-[32px] mb-[70px] text-white">
                        <p>
                            Всем привет!
                            <br /><br />
                            Зимняя распродажа в Steam подошла к концу, а вместе с ней Valve объявила победителей ежегодной премии The Steam Awards 2025! Миллионы игроков со всего мира голосовали за свои любимые проекты, и теперь мы знаем, кто забрал заветные награды.
                            <br /><br />
                            Давайте посмотрим на выбор народа и решим, во что стоит поиграть прямо сейчас!
                            <br /><br />
                            Главные победители Steam Awards 2025
                            <br />
                            Сообщество сделало свой выбор! Вот список игр, которые стали лучшими в этом году:
                        </p>
                        <br /><br /><br />
                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">🏆 «Игра года» — Hollow Knight: Silksong</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Игроки ждали. И ожидание того стоило! Hollow Knight: Silksong — это просто шедевр. Безупречный геймплей, завораживающий мир, который хочется исследовать часами, и невероятная атмосфера. Это не просто лучшая игра года, это приключение, которое ты запомнишь на всю жизнь.</li>
                                </ul>
                            </div>
                            <img src="/news/1/1.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Игра года в виртуальной реальности» — The Midnight Walk</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Надень VR-шлем и погрузись в атмосферу полуночной прогулки, где каждый шорох заставляет сердце биться чаще. Это не просто игра, а настоящее приключение с полным эффектом присутствия, от которого по коже бегут мурашки.</li>
                                </ul>
                            </div>
                            <img src="/news/1/2.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Любимое дитя» (игра с лучшей поддержкой) — Baldur's Gate 3</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Даже спустя время после релиза разработчики из Larian Studios не перестают удивлять! Они продолжают выпускать гигантские обновления, добавлять новый контент и прислушиваться к игрокам. Эта игра живет и становится только лучше.</li>
                                </ul>
                            </div>
                            <img src="/news/1/3.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Лучшая игра на Steam Deck» — Hades 2</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Идеальный "рогалик", чтобы заскочить на пару забегов где угодно! Быстрые сессии, ураганный геймплей и крутая графика, которая отлично смотрится на портативном экране. Твой Steam Deck просто создан для этой игры.</li>
                                </ul>
                            </div>
                            <img src="/news/1/4.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Друг познаётся в игре» (лучшая кооперативная игра) — PEAK</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Зови друзей и готовься к испытаниям! Эта игра — настоящая проверка вашей командной работы и дружбы. Только действуя слаженно, вы сможете покорить вершину и доказать, что вы — лучшая команда.</li>
                                </ul>
                            </div>
                            <img src="/news/1/5.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Выдающийся визуальный стиль» — Silent Hill f</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Жуткая красота японской глубинки, от которой невозможно оторвать взгляд. Каждый кадр в этой игре — это произведение искусства, пропитанное атмосферой безысходности и страха. Незабываемый и по-настоящему уникальный стиль.</li>
                                </ul>
                            </div>
                            <img src="/news/1/6.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Самый инновационный геймплей» — ARC Raiders</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Забудь все, что ты знал о кооперативных шутерах. ARC Raiders ломает шаблоны, предлагая уникальные механики и тактические бои с гигантскими роботами, где без смекалки и командной игры просто не выжить.</li>
                                </ul>
                            </div>
                            <img src="/news/1/7.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Лучший саундтрек» — Clair Obscur: Expedition 33</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Просто включи наушники и наслаждайся. Эпическая и трогательная музыка из этой игры создает невероятную атмосферу и превращает каждое сражение в настоящее представление. Этот саундтрек ты точно добавишь в свой плейлист.</li>
                                </ul>
                            </div>
                            <img src="/news/1/8.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Лучшая игра с выдающимся сюжетом» — Dispatch</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>История, которая вжимает в кресло с первых минут и не отпускает до самых титров. Напряженный триллер с неожиданными поворотами, где каждое твое решение имеет последствия. Ты не сможешь оторваться, пока не узнаешь, чем все закончится.</li>
                                </ul>
                            </div>
                            <img src="/news/1/9.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <div className="flex items-start gap-9 max-lg:flex-col">
                            <div>
                                <p className="text-[32px] font-medium leading-10.5">«Устройтесь поудобнее» — RV There Yet?</p>
                                <ul className="list-disc list-inside mt-7 flex">
                                    <li>Идеальная игра для отдыха после тяжелого дня. Забудь о стрессе и просто наслаждайся медитативным путешествием в своем доме на колесах. Никакого напряга, только красивые пейзажи и полное расслабление.</li>
                                </ul>
                            </div>
                            <img src="/news/1/10.png" alt="hollow-knight" className="max-w-[524px] rounded-3xl max-lg:max-w-full" />
                        </div>

                        <br /><br />

                        <p className="mt-[10px] flex text-white font-medium text-[32px] leading-9">Распродажа кончилась, а скидки остались!</p>
                        <br />
                        <p>
                            Приглянулось что-то в Steam? Пополняй баланс у нас!
                            <br /><br />
                            Если же вы нашли в Steam другую игру, которая запала вам в душу, или хотите купить что-то из списка номинантов, то и тут мы поможем!
                            <br /><br />
                            Забудьте о проблемах с оплатой. На нашем сайте вы можете моментально и безопасно пополнить баланс своего Steam-аккаунта и сразу же отправиться за покупками.
                            <br /><br />
                            <ul>
                                <li className="list-disc list-inside">Быстро: Деньги приходят за пару минут.</li>
                                <li className="list-disc list-inside">Удобно: Множество способов оплаты.</li>
                                <li className="list-disc list-inside">Надежно: Мы используем только проверенные методы и сервисы.</li>
                            </ul>
                            <br />
                            Не откладывай лучшие игры на потом. Выбирай победителей, закупайся выгодно и играй с удовольствием
                        </p>
                    </div>

                    <div className="pb-[88px] text-white">
                        <NewsBlock />
                    </div>
                </div>
            </div>
            <Footer />
        </div>
    )
}

export default News